app/views/contests/show.html.erb


<% if @contest.videos.any? %>
---
SELECT  1 AS one FROM "videos"  WHERE "videos"."contest_id" = ? LIMIT 1  [["contest_id", 2]]
SELECT "videos".* FROM "videos"  WHERE "videos"."contest_id" = ?  [["contest_id", 2]]