app/views/users/show.html.erb

<h1 class="title">Listing contests</h1>
<% if @user.contests.any? %>
---
SELECT  1 AS one FROM "contests"  WHERE "contests"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT "contests".* FROM "contests"  WHERE "contests"."user_id" = ?  ORDER BY "contests"."created_at" DESC  [["user_id", 1]]