app/controllers/contests_controller.rb

  def index
    @contests = Contest.all
---
SELECT  "contests".* FROM "contests"  WHERE ('user_id')  ORDER BY "contests"."created_at" DESC LIMIT 1

  def create
    @contest = current_user.contests.new(contest_params) do |t|
    #@contest.user = current_user
      if contest_params[:data]
        contest_params[:data].rewind
        t.binary_data = contest_params[:data].read
        t.filename = contest_params[:data].original_filename
        t.content_type = contest_params[:data].content_type
      end
    end

    respond_to do |format|
      if @contest.save
---
INSERT INTO "contests" ("binary_data", "content_type", "created_at", "description", "enddate", "filename", "name", "startdate", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @contest.update(contest_params)
---
UPDATE "contests" SET "binary_data" = ?, "content_type" = ?, "filename" = ?, "updated_at" = ? WHERE "contests"."id" = 2  [["binary_data", "<71581 bytes of binary data>"], ["content_type", "image/jpeg"], ["filename", "pics01.jpg"], ["updated_at", "2015-09-19 02:28:04.577947"]]

  def destroy
    @contest.destroy
---
DELETE FROM "contests" WHERE "contests"."id" = ?  [["id", 1]]

  def serve
    @contest = Contest.find(params[:id])
---
SELECT  "contests".* FROM "contests"  WHERE "contests"."id" = ?  ORDER BY "contests"."created_at" DESC LIMIT 1  [["id", 2]]

  def set_contest
    @contest = Contest.find(params[:id])
---
SELECT  "contests".* FROM "contests"  WHERE "contests"."id" = ?  ORDER BY "contests"."created_at" DESC LIMIT 1  [["id", 4]]