app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "lastname", "name", "password_digest", "roles_mask", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
   # user_params.permit!
    #@user = User.new(params[:user].permit!)

    if @user.save