app/controllers/videos_controller.rb

  def edit
    @video = @contest.videos.find(params[:id])
---
SELECT  "videos".* FROM "videos"  WHERE "videos"."contest_id" = ? AND "videos"."id" = ? LIMIT 1  [["contest_id", 2], ["id", 8]]

  def load_parent
    unless params[:contest_id]==nil
       @contest = Contest.find(params[:contest_id])
---
SELECT  "contests".* FROM "contests"  WHERE "contests"."id" = ?  ORDER BY "contests"."created_at" DESC LIMIT 1  [["id", 3]]